Tekla Open API Reference for Tekla Structures 2025
Material.MaterialString Property
 Identifies the material in a string format.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string MaterialString { get; set; }
Public Property MaterialString As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Material Class
Tekla.Structures.Model Namespace